app/controllers/home_controller.rb

SELECT  "actors".* FROM "actors" WHERE "actors"."name" = ? LIMIT ?  [["name", "Akshay Kumar"], ["LIMIT", 1]]
SELECT "movies"."name" FROM "movies" INNER JOIN "roles" ON "movies"."id" = "roles"."movie_id" WHERE "roles"."actor_id" = ?  [["actor_id", 1]]
SELECT "movies".* FROM "movies" WHERE (rating >= '1')
---
  def search
    @movies = if search_params[:actor].present?
                Actor.find_by(name: search_params[:actor]).movies
              elsif search_params[:rating].present?
                Movie.where("rating >= ?", search_params[:rating])